Repository: joykuotw/flutter_sandbox
Catalog: lib/l10n/app_*.arb
Languages: it

# cameraTitle
source: Camera
it: Telecamera

# basicWidgetsTitle
source: Basic Widgets
it: Widget di base

# basicEffectsTitle
source: Basic Effects
it: Effetti di base

# thankYouTitle
source: Thank you
it: Grazie

# languagesTitle
source: Languages
it: Le lingue

# registerTitle
source: Register
it: Registrati

# licenseTitle
source: License
it: Licenza

# demosTitle
source: Demos
it: Demo

# darkModeTitle
source: Dark Mode
it: Modalità scura

# draggableTitle
source: Draggable
it: Trascinabile

# databaseTitle
source: Database
it: Banca dati

source: Log out
it: Disconnettersi

# firebaseCrashlyticsMessage
source: Press the button to simulate a crash. Restart the app for crashlytics to log the crash
it: Premere il pulsante per simulare un incidente. Riavvia l'app affinché crashlytics registri l'arresto anomalo

# firebaseCrashlyticsWebMessage
source: Firebase Crashlytics does not support web apps.
it: Firebase Crashlytics non supporta le app web

# firebaseCrashlyticsButton
source: Press to crash
it: Premi per andare in crash

# basicEffectsParallaxTitle
source: Parallax
it: Parallasse

# basicEffectsIndexNumberOf
source: Index number is
it: Il numero di indice è

# basicEffectsIndex
source: Index
it: Indice

# basicEffectsIndexDescription
source: travelled from far. Either your internet speed or distance was a factor for the delay to arrive, so adding some shimmer to it.
it: viaggiato da lontano. O la velocità o la distanza di Internet erano un fattore per il ritardo nell'arrivo, quindi aggiungi un po 'di brillantezza.

# basicWidgetsCheckboxTitle
source: Checkbox
it: Casella di controllo

# basicWidgetsExpansionListTitle
source: Expansion List
it: Elenco di espansione

# basicWidgetsChooseDate
source: Choose Date
it: Scegli la data

# basicWidgetsChooseTime
source: Choose Time
it: Scegli l'ora

# basicWidgetsWakeUp
source: Wake up
it: Svegliati

# basicWidgetsPutOnTheSuit
source: Put on the suit
it: Indossa la tuta

# basicWidgetsBetheHero
source: Be the Hero
it: Sii l'eroe

# basicWidgetsExpansionPanelText
source: To delete this panel, tap the trash can icon
it: Per eliminare questo pannello, tocca l'icona del cestino

# basicWidgetsExpansionPanelDefaultText
source: No views to be found
it: Nessuna vista da trovare

# basicWidgetsPanel
source: Panel
it: Pannello

# basicWidgetsThisIsItemNumber
source: This is item number
it: Questo è il numero dell'articolo

# cameraNotSupportedText
source: Camera is not supported yet on this platform.
it: La fotocamera non è ancora supportata su questa piattaforma.

# displayThePictureTitle
source: Display the Picture
it: Visualizza l'immagine

# displayTheVideoTitle
source: Display the Video
it: Visualizza il video

source: Got it
it: Fatto

# firebaseAuthSignOut
source: Sign out
it: Disconnessione

# firebaseAuthEnterYourEmail
source: Enter your email
it: Inserisci il tuo indirizzo email

# firebaseAuthEnterYourPassword
source: Enter your password
it: Inserisci la tua password

# firebaseAuthLogIn
source: Log In
it: Accesso

# firebaseAuthEmptyFieldError
source: Email & Password field cannot be empty.
it: Il campo Email e Password non può essere vuoto.

# firebaseAuthInitiationError
source: Could not initiate Firebase Auth
it: Impossibile avviare Firebase Auth

# firebaseAuthRegister
source: Register
it: Registrati

# firebaseSignedInSecretMessage
source: Welcome! You are in the secret room now.
it: Benvenuto! Adesso sei nella stanza segreta.

# firestoreEditingMode
source: Editing Mode
it: Modalità di modifica

# firestoreSave
source: Save
it: Salva

# firestoreEnterAShortNote
source: Enter a short note.
it: Inserisci una breve nota.

# loadingCAPS
source: LOADING
it: CARICAMENTO IN CORSO

# functionsFetchGeoJSON
source: Fetch geoJSON
it: Recupera geoJSON

# googleMapsToThePool
source: To the Pool
it: Alla piscina

# gpsLocationsServiceDisabled
source: Location services are disabled.
it: I servizi di localizzazione sono disabilitati.

# gpsLocationsServicePermanentlyDisabled
source: Location permissions are permanently denied, we cannot request permissions.
it: Le autorizzazioni per la posizione vengono negate in modo permanente, non possiamo richiedere le autorizzazioni.

# gpsLocationsServiceDenied
source: Location permissions are denied.
it: Le autorizzazioni per la posizione vengono negate.

# gpsLatitude
source: Latitude
it: Latitudine

# gpsLongitude
source: Longitude
it: Longitudine

# gpsLocateMe
source: Locate me
it: Localizzami

# mapboxNotSupported
source: Currently Mapbox is not fully supported yet.
it: Attualmente Mapbox non è ancora completamente supportato.

# riveIdle
source: Idle
it: Inattiva

# riveBouncing
source: Bouncing
it: Rimbalzare

# riveWipers
source: Wipers
it: Tergicristalli

# riveBroken
source: Broken
it: Rotta

# draggableCorrect
source: Correct
it: Corretto

# draggableWrong
source: Wrong
it: Sbagliato

# draggableOdd
source: Odd
it: Dispari

# draggableEven
source: Even
it: Pari

# fcmGetToken
source: Get Token
it: Ottieni token

# dbName
source: Name
it: Nome

# dbAge
source: Age
it: Età

# dbRole
source: Role
it: Ruolo

# semCameraPgRearCameraToggleButton
source: Button for rear camera view
it: Pulsante per la visualizzazione della telecamera posteriore

# semCameraPgFrontCameraToggleButton
source: Button for front camera view
it: Pulsante per la visualizzazione della fotocamera frontale

# semCameraPgStillCameraToggleButton
source: Button for changing camera mode to taking still pictures
it: Pulsante per cambiare la modalità della fotocamera per scattare foto

# semCameraPgVideoCameraToggleButton
source: Button for changing camera mode to taking videos
it: Pulsante per cambiare la modalità della fotocamera per registrare video

# semCameraPgTakeStillCameraButton
source: Button for taking still picture
it: Pulsante per scattare foto

# semCameraPgTakeVideoCameraButton
source: Button for taking videos
it: Pulsante per fare video

# semCameraPgStopVideoCameraButton
source: Button for stopping video capture
it: Pulsante per interrompere l'acquisizione video

# semCameraPgFrontCameraSelected
source: Front camera selected
it: Fotocamera anteriore selezionata

# semCameraPgRearCameraSelected
source: Rear camera selected
it: Fotocamera posteriore selezionata

# semCameraPgLensDirectionToggle
source: Toggle between front and rear camera
it: Passa dalla fotocamera anteriore a quella posteriore

# semCameraPgStillCameraModeSelected
source: Picture capture mode selected
it: Modalità di acquisizione dell'immagine selezionata

# semCameraPgVideoCameraModeSelected
source: Video capture mode selected
it: Modalità di acquisizione video selezionata

# semCameraPgCameraModeToggle
source: Toggle between picture and video capture mode
it: Passa dalla modalità di acquisizione di immagini a quella di video

# semBasicWidgetPgContinuousSliderLabel
source: Continuous slider for demo
it: Slider continuo per demo

# semBasicWidgetPgContinuousSlider
source: Continuous slider value is
it: Il valore del dispositivo di scorrimento continuo è

# semBasicWidgetPgDiscreteSliderLabel
source: Discrete slider for demo
it: Slider discreto per demo

# semBasicWidgetPgDiscreteSlider
source: Discrete slider value is
it: Il valore del dispositivo di scorrimento discreto è

# semBasicWidgetPgTrashButton
source: Press to delete item
it: Premi per eliminare l'elemento

# semFirestorePgEditSwitchButton
source: Switch button to Enable or disable editing mode
it: Pulsante Passa a Abilita o disabilita la modalità di modifica

# semFirestorePgSaveButton
source: Save note
it: Salva nota

# semFunctionsPgSaveButton
source: Fetch geoJSON
it: Recupera geoJSON

# semGoogleMapsPgToThePoolButton
source: View the pool location on map
it: Visualizza la posizione della piscina sulla mappa

# semRivePgCarAnimation
source: Car animation window
it: Finestra di animazione dell'auto

# semRivePgCarAnimationToggleButton
source: Car animation toggle button between idle, bouncing, wipers and broken
it: Pulsante di attivazione/disattivazione dell'animazione dell'auto tra inattivo, rimbalzante, tergicristalli e rotto

# semFirestoreStoragePgFABButton
source: Add to upload task
it: Aggiungi per caricare l'attività

# semDarkModePgSwitch
source: Switch for toggling between dark mode and light mode
it: Passa per alternare tra modalità oscura e modalità luce

# semDarkModePgDarkModeOn
source: Dark mode selected
it: Modalità scura selezionata

# semDarkModePgDarkModeOff
source: Light mode selected
it: Modalità luce selezionata
